mapData = {
    "gk": {
        "ja": {
            "rate": 11.82,
            "value": 10162
        },
        "sa": {
            "rate": 13.48,
            "value": 11870
        },
        "wj": {
            "rate": 54.61,
            "value": 3364
        }
    },
    "mapData": {
        "110000010000": {
            "areaName": "高院",
            "jc": 282,
            "mapId": "110000010000",
            "name": "上海市高级人民法院",
            "wj": 539,
            "xs": 1542,
            "yj": 1285
        },
        "110011010001": {
            "areaName": "一中",
            "jc": 126,
            "mapId": "110011010001",
            "name": "上海市第一中级人民法院",
            "wj": 172,
            "xs": 1026,
            "yj": 980
        },
        "110011011104": {
            "areaName": "徐汇",
            "jc": 28,
            "mapId": "110011011104",
            "name": "徐汇区人民法院",
            "wj": 70,
            "xs": 264,
            "yj": 222
        },
        "110011011106": {
            "areaName": "闵行",
            "jc": 70,
            "mapId": "110011011106",
            "name": "闵行区人民法院",
            "wj": 91,
            "xs": 333,
            "yj": 312
        },
        "110011011107": {
            "areaName": "浦东",
            "jc": 123,
            "mapId": "110011011107",
            "name": "浦东新区人民法院",
            "wj": 288,
            "xs": 1415,
            "yj": 1250
        },
        "110011011109": {
            "areaName": "奉贤",
            "jc": 17,
            "mapId": "110011011109",
            "name": "奉贤区人民法院",
            "wj": 65,
            "xs": 484,
            "yj": 436
        },
        "110011011110": {
            "areaName": "松江",
            "jc": 61,
            "mapId": "110011011110",
            "name": "松江区人民法院",
            "wj": 738,
            "xs": 1074,
            "yj": 397
        },
        "110011011111": {
            "areaName": "金山",
            "jc": 8,
            "mapId": "110011011111",
            "name": "金山区人民法院",
            "wj": 18,
            "xs": 164,
            "yj": 154
        },
        "110011120001": {
            "areaName": "二中",
            "jc": 258,
            "mapId": "110011120001",
            "name": "上海市第二中级人民法院",
            "wj": 389,
            "xs": 1173,
            "yj": 1042
        },
        "110011121113": {
            "areaName": "黄浦",
            "jc": 64,
            "mapId": "110011121113",
            "name": "黄浦区人民法院",
            "wj": 104,
            "xs": 832,
            "yj": 792
        },
        "110011121118": {
            "areaName": "杨浦",
            "jc": 17,
            "mapId": "110011121118",
            "name": "杨浦区人民法院",
            "wj": 35,
            "xs": 219,
            "yj": 201
        },
        "110011121119": {
            "areaName": "宝山",
            "jc": 11,
            "mapId": "110011121119",
            "name": "宝山区人民法院",
            "wj": 23,
            "xs": 407,
            "yj": 395
        },
        "110011121120": {
            "areaName": "嘉定",
            "jc": 9,
            "mapId": "110011121120",
            "name": "嘉定区人民法院",
            "wj": 22,
            "xs": 191,
            "yj": 178
        },
        "110011121121": {
            "areaName": "青浦",
            "jc": 55,
            "mapId": "110011121121",
            "name": "青浦区人民法院",
            "wj": 58,
            "xs": 421,
            "yj": 418
        },
        "110011121122": {
            "areaName": "崇明",
            "jc": 16,
            "mapId": "110011121122",
            "name": "崇明区人民法院",
            "wj": 31,
            "xs": 182,
            "yj": 167
        },
        "110011300001": {
            "areaName": "上铁",
            "jc": 353,
            "mapId": "110011231124",
            "name": "上海铁路运输法院",
            "wj": 482,
            "xs": 1176,
            "yj": 1047
        },
        "110011290001": {
            "areaName": "海事",
            "jc": 0,
            "mapId": "110011290001",
            "name": "上海海事法院",
            "wj": 1,
            "xs": 1,
            "yj": 0
        },
        "110011310001": {
            "areaName": "三中",
            "jc": 158,
            "mapId": "110011310001",
            "name": "上海市第三中级人民法院",
            "wj": 238,
            "xs": 966,
            "yj": 886
        },
        "110011231125": {
            "areaName": "长宁",
            "jc": 158,
            "mapId": "110011231125",
            "name": "长宁区人民法院",
            "wj": 238,
            "xs": 966,
            "yj": 886
        },
        "110011231126": {
            "areaName": "普陀",
            "jc": 158,
            "mapId": "110011231126",
            "name": "普陀区人民法院",
            "wj": 238,
            "xs": 966,
            "yj": 886
        },
        "110011231127": {
            "areaName": "静安",
            "jc": 158,
            "mapId": "110011231126",
            "name": "静安区人民法院",
            "wj": 238,
            "xs": 966,
            "yj": 886
        },
        "110011231128": {
            "areaName": "虹口",
            "jc": 158,
            "mapId": "110011231126",
            "name": "虹口区人民法院",
            "wj": 238,
            "xs": 966,
            "yj": 886
        }
    }
}